/*
Напишите программу, которая выводит случайное число из отрезка [10, 99] и показывает наибольшую цифру числа.

65 -> 6
*/

int num = new Random().Next(10, 100);

/* Random -  случайное число */

int a1 = num / 10;
int a2 = num % 10;
/* / - целочисленный остаток( 123 - 12), % - дробная часть(123 - 3) */

int max = a1;
if (a2 > max)
{
     max = a2;

}
Console.Write($"наибольшая цифра {max}  из числа {num}");